<template>
 <h4> Что бы я сделал для удобной работы с гитом.</h4>
  <p>

    Сейчас мы работаем в ветках. Это я считаю неправильным, и уже предлагал десятки поводов того, почему нам нужно переходить на работу с версиоанностью, и использованию ветку девелоп. (сейчас который, почему-то не используем)
  </p><p>

    Вот как должно быть. Получаем задачу, создаем ветку по задаче. Сделав задачу, сохраняем в ветке, а так же делаем мерж-реквест в ветку Develop (вот эта часть сейчас не делается). В девелопе будут копиться изменения бакенда и фронтенда.. Тестируем в девелопе. И когда нужно опубликовать на продуктовом сайте, создаем ветку из продуктового кода(чтобы вернуться если что), и заливаем весь девелоп на продукт.
    Это будет новая версия. Если возникает опасный случай, когда изменения останавливают работу, можно бстро вернуться на старую версию.

</p>
  <p>
    Нужно в каждом окмментарии писать что делают эти изменения в коде. <br>
    При необходимости разбить комит на несколько, чтобы удобнее было разбиратсья при последующей поддержке.
  </p>

  <h4>- тестирование</h4>

  <p>Сейчас для тестировния используется тестовый сайт r3 - где может быть отражен сайт только с одной веткой гита..
    Можно  протестировать одну ветку, переключиться на другую ветку. Ошибок например нет. Но если их слить воедино - могут появиться ошибки.
    Ведь они могли работать с одной и той же переменной, но по разному. Похожее уже бывало.<br>
    Такое у нас сейчас можно обнаруживать только на продуктовом сайте.. Если бы мы сливали в девелоп и проверяли на нем, этих ошибок можно было бы избежать.<br>
    Так же для тестирования будет удобнее. не нужно ждать переключая ветки. Сразу видим все изменения вместе.
  </p>
  <h4>по редактированию API</h4>
    <p>На тестовом сайте r2 бэкендоры начали рефакторить бакендные методы. И заметил что проявились  ошибки.. <br>
      Это происходит, если gпосле изменений меняется сигнатура API, то что приходит клиенту поменялась.<br>
    Если метод меняешь, нужно добиться того, чтобы отправляющиеся на клиент данные не менялись. Если какой-то параметр не придет, сайт перестанет работать.. <br>
      Можно лишь добавлять новые параметры.<br>
      <br>
    Но по правильному, как рекомендует прицип SOLID, нужно создать новый API а старый перевести в режим deprecated(устаревший) <br>
      И нужно будет уже дорабатывать на стороне клиента, чтобы подключиться к новому Апи. После чего устаревший метод можно удалить.
      <br>
    </p>
  <h4>по передаче задач друг другу.</h4>
  <p>
    Основная часть времени тратится на то чтобы понять, где получить данные, как воспроизвести ошибку, ситуацию.<br>
    Нам нужно придумать, как информативнее это делать,    чтобы дополнительно не переспрашивать в телеграмм.<br><br>
    Предложение такое.
    Нужно передать ссылку где, кем и как воспроизводить ситуацию. Шаги на какие кнопки нажимать.<br>
    Описать метод, как им пользоваться, можно приложить пример использования.<br>
    Убрать лишние слова, чтобы не приводило к заблуждениям. Без сокращений, ведь возможно в будущем будем читать эти комментарии.


  </p>
</template>
<script setup>
</script>