<template>
  <h4>
    - по парсингу сайтов Авита, Avto.ru, Drom.ru.
  </h4>
  <p>

    В браузере хром можно делать расширения (используя js и vue3). Вот мой <a
      href="/v2/public/plaginApelsin.zip">пример</a>.<br>
    Плагин может имитировать поведение человека и собирать данные. <br>
    Все что попадает на браузер клиента, может быть использована нами, можно например создать на основе этих данных
    обращения в нашей системе<br>
    Это бесплатно, законно. Тогда как есть и платные АПИ для таких целей. <br>

  </p>

  <h4>
    - по поводу работы со стажерами
  </h4>
  <p>

    Работа молодыми программистами выгодно для организации.<br>
    Новое поколение хочет накопить опыт работы, чему-нибудь научиться на реальных проектах. <br>
    Нам нужны бесплатные или недорогие свободные руки. Они могут удаленно работать. <br>
    От нас лишь некоторый доступ к нашим ресурсам, поддержка и постановка задач.<br><br>
    Есть у студентов обязанность проходить практику. Организация может в этом им помощь. <br>
    Если временным новобранцам создать условия, при котором они себя смогу проявить, можно стать кузнецой новых кадров.
    <br>
    И самим получить лучших разработчиков.
  </p>

  <h4>
    - по поводу поиска лучших решений для развития рабочего сайта
  </h4>
  <p>
    Нужно программиста задействовать в прохождении некоторых этапов бизнеса.<br>
    Так он увидит тонкие места в программе, поймет что можно автоматизировать, какие фукнции добавить, улучшить. <br>
  </p>

  <h4>
    - как рабочий сайт использовать для прямого взаимодействия с клиентом
  </h4>
  <p>
    При желании клиента можно выдать специальную ссылку, где клиент сможет взаимодействовать с байером, с оператором
    Кол-центра.<br>
    Клиент сможет смотреть этапы прохождения сделки, знакомиться с предложениями, участвовать в акциях, может ссылкой
    поделиться с другими.<br>

    Сейчас рабочий сайт доступен в интернете только по паролю. Можно создать для клиентов индивидуальную ссылку без
    пароля.
  </p>

  <h4>
    - использовать карту для навигации
  </h4>
  <p>
    Байеоры могут находиться передвигаться по разным местам. И публиковать через телефон свое местоположение по GPS<br>
    Клиенты могут позвонить, сообщить свою координату оператору. После чего наша программа сможет найти ближайшего
    байера и направить к нему.
    Байер может выключить публикацию своего местоположения, чтобы его не тревожили, когда он занят или отдыхает. <br>
    Байер также может установить свое местоположение по умолчанию (тут публикация GPS yне нужна), если хочет набирать
    клиентов для следующих встреч попозже

  </p>

  <h4>
    - сайт, работающий без интернета
  </h4>
  <p>
    У меня есть готовая разработка, где например байеоры могли бы находясь в местах без интернета, <br>
    сфоткать автомобиль, заполнить данные,
    которые бы отправились автоматически на наши сервера при появлении интернета
  </p>

  <h4>
    - работа с bigData, аналитика
  </h4>
  <p>
    У нас накопилось много данных, по которым можно делать какие-то выводы.<br>
    Например вычислить самых активных клиентов, и держать связь с ними .<br>
    Вычислить продающиеся самые прибыльные марки, и на них больше ориентироваться.<br>
    Собирать данные по каким причинам покупают и продают автомобили, и находиться рядом при таких решениях.<br>
    Строить графики, сравнивать и выявлять тренды, делать аналитику используя визуализацию<br>

  </p>
</template>
<script setup>
</script>