<template>

  <h4>Задачи внутреннего, рабочего сайта организации (Интранета):</h4>
  <h5>Стать лучшим и удобным инструментом для работы</h5>
  <p>Инструменты для всех этапов бизнеса</p>
  <p>Уведомления о новых событиях в процессах</p>
  <p>Быстрый доступ к контактам</p>
  <p>Возможность для сотрудников оставлять отзывы и предложения.</p>
  <h5>Централизованная информация</h5>
  <p>Автоматизация рутинных задач (например, заявок на отпуск или отчётов о расходах).</p>
  <p>Обеспечение доступности необходимых форм и шаблонов документов.</p>
  <p> На сайте публиковать отзывы, отчеты, акции, диаграммы, таблицы, например по популярности покупаемых машин и т.д.


  </p>
  <h5>Интуитивно понятный интерфейс</h5>
  <p>Доступ к обучающим материалам, вебинарам и онлайн-курсам.</p>
  <p>Базы знаний и часто задаваемые вопросы.</p>
  <h5>Интеграция с другими системами</h5>

  <h5> Сбор информации, опросы.</h5>


</template>
<script setup>
</script>