<template>
  <h4>Задачи сайта перед бизнесом:</h4>

  <h5> Расширение аудитории</h5>
  <p>Можно выставлять машины на продажу на спец.платформах типа Авита, и также нужно выставлять их у себя на сайта
    тоже. Сделать попроще (парадигма KISS) и реагировать быстрее, так можно раскрутить свою платформу
  </p>

  <h5> Повышение уровня доверия.</h5>
  <p> На сайте публиковать отзывы, отчеты, акции, диаграммы, таблицы, например по популярности покупаемых машин и т.д.
  </p>

  <h5> Удобство для клиентов</h5>
  <p>Теперь все можно делать через сайт. Идеальный случай, продовать и
    покупать машины не вызодя из дома. Нужно сделать такую возможность.
    Возможность просмотра вариантов, и возможность отправить свою машину на продажу,
    просто сфоткав со всех стороон. Общение через сайт, через видеоконференцию или через набор текста.
  </p>

  <h5> Маркетинг и реклама</h5>
  <p>Можно публиковать на сайте материалы для привлечения покупателей или продавцов.</p>

  <h5> Сбор информации от поситетелей.</h5>
  <p>Можно устраивать опросы. <br>
    Также можно наблюдать за пользователями сайта, через Google Analytics
    Узнать откуда больше заходят, с каких платформ (Android, iOS) c каких регионов.
  </p>


</template>
<script setup>
</script>