<template>
 <p>
   Переход на новую версию сайта нужно делать пошагово. Отдел за отделом<br>
   Например переделать часть сайта для одного отдела, например Кол-центра.<br>
   Попросить маленькую группу операционистов поработать в обновленной версии, устранить все ошибки.<br>
   Потом предложить всем операторам Кол-центра работать в новой версии.<br>
   Старую версию больше не обновлять для Кол-центра. Хотя старый сайт останется доступен для чрезвычайных случаев.
 </p>

  <p>
    Некоторое время будут работать одновременно две версии сайта. Они работают с одной и той же базой, т.е. взаимозаменяемы.<br>
    Но обновления: улучшения, новые фичи будут появляться только в новой версии сайта.
  </p>

  <p>
    Нужно создать обратную связь с каждым пользователем. Чтобы они могли жаловаться, или предлагать свои варианты. И затем эти знания использовать для будущих модернизаций программы.
  </p>
  <p>
    Сайт должен вести отчет по версиям. Отображать, какие изменения произошли,
    <RouterLink to="/version">
      вот пример
    </RouterLink><br>
    Можно писать по чьей инициативе(получив согласие) появились изменения, поощряя таким образом пользователей стать участниками по улучшению сайта.
  </p>
</template>
<script setup lang="ts">
</script>