<template>
  <h4>Зависания сайта</h4>
  <p>
    В последнее время сайт часто начал зависать.
    Предположение: отчеты работают медленно, или сильно нагружают процессор, что приводит к обрыву по таймауту или ошибке.
    <br>
    Обнаружилось сложная логика по работе с запросами.
    Нужно оптимизовать работу со SQL запросами

    <br><br>
    На серверах лежат много фотографий, которые программой не используются.
    Их нужно вывести на наши сервера, не тратить драгоценное места на платных серверах.<br>
    Возможно организовать обработку имеющихся фоток, например через ИИ распознование,  собрать по ним данные, которые можно использовать
    <br>
   Переполненные дисковые хранилища, тоже не способствуют быстроте работы сайта.
  </p>
  <h4>    Идея тонкого клиента  </h4>
  <p>
    Сайт чем меньше участвует в бизнес логике тем быстрее работает.<br>
    Нужно добиться того, чтобы на сайт клиента приходили только необходимые данные.<br>
    Нужно уменьшить коичество вызовов, в одном вызове отправить всю модель, а не создавать API для получения каждого параметра.<br>
    Не скажу что частое явление, но иногда можно было бы без новых АПИ обойтись. <br>
    Это облегчит поддержку и в бакенде и в фронтенде. Ведь привязываемся к моделям, а не к событиям.<br>
  </p>
</template>
<script setup>
</script>