<template>
  <p>
    На данный момент есть три лидирующих технологий React, Vue и Angular.<br>
    При этом AngularJS, который используется нами, уже больше не поддерживается, только старшие версии, которые сильно
    отличаются и легкого перехода на них нет.<br>
    Технология Vue3 больше похожа на angularJS чем angular18 на angularJS
  </p>
  <p>
    Vue3 имеет ряд преимуществ, даже перед самым распространненным React. <br>Vue3 фрeймворк, когда как react это библиотека. Что означает что Vue eуже в себе содержит все необходимые компоненты и они прекрасно согласованы
  </p>
  <p>
    Vue3 на сегодняшний день считается самой быстрой, среди всех представленных
  </p>

  <p>
    Vue3 CompositionApi выпущенная в 2020 году и на сегодняшний день, надежная, хорошо протестированая система. <br>
    Так же в этом проекте используется очень быстрый сборчик файлов Vite - которая пришла на смену Webpack<br>
    Pinia - удобное хранилище данных, для взаимосвязи между модулями<br>
    ElementPlus - контролы, простые и легкоизменяемые под свои нужды<br>
  </p>

</template>
<script setup lang="ts">
</script>