<template>
  <div>
    <h2>Байер. Инструкция по работе с программой</h2>
    <p>Байер - менеджер по продаже/покупке автомобилей.</p>
    <p>Программа расчитана работать на мобильниках,
      планшетах с узким экраном, а также на настольных компьютерах.</p>
    <p>С помощь. данной программы, байер заносит данные по автомобилю.
      Загружает фотографии, указывает повреждения.
    </p>
    <p>Это данные передаются аналитику, который назначает коридор цен, когда сделка возможна.</p>
    <p>Байер регистрирует сделку. </p>
    <p>Смотрит статус сделки. </p>
    <p>Ведет отчет </p>


  </div>
</template>
<script setup>
</script>