<template>
  <div>
    <h2>Байер. Инструкция по работе с программой.</h2>
    <i>Байер - менеджер по продаже/покупке автомобилей.</i>
    <p>Программа оптимизирована для работы на мобильных телефонах, что позволит работать в полевых условиях.
      Байер добавляет данные по автомобилю и по клиенту в базу программы.
      Загружает фотографии автомобиля, указывает повреждения, замечания.
    </p>
    <p>Данные отправленные аналитику, возвращаются с коридором цен, исходя из которого байер приступает к сделке.
      Выгружает необходимые документы, оформляет сделку.</p>
    <p>Байер в любой момент времени, может посмотреть статус документа, изменить/исправить упущенные детали. Создать отчет по
      документам. Просматривать историю процесса.
      Может поделиться/отправить некоторые данные клиенту по qr-коду или ссылке. Например это может быть электронная версия сделки, или другие детали.
      Это может быть безрегистрационный доступ к страничке сайта по особому коду GUID - открытую в интернете на некоторое время.</p>

    <el-steps :active="2" style="background: white; padding: 30px">
      <el-step title="Обращение"/>
      <el-step title="Набор данных" :icon="Edit"/>
      <el-step title="Аналитика: Оценка"/>
      <el-step title="Ремонт"/>
      <el-step title="Продажа"/>
    </el-steps>


  </div>
</template>
<script setup>
import {Edit} from "@element-plus/icons-vue";
</script>