<template>
  <div>
    <h4>Главное назначение программы?</h4>
    <p>
      Облегчить работу по продаже/покупке подержанных автомобилей
    </p>

    <h4>Кто пользуется программой?</h4>
    <p>
      <ol>
        <li>Call - center</li>
        <li>Менеджер по продажам</li>
        <li>Оценщик/аналитик а/м</li>
        <li>Ремонтник</li>
      </ol>
    </p>

    <h4>Главный акцент программы для каждого пользователя</h4>
    <ol>
      <li>Страница работы с Авито для Call - center</li>
      <li>Описание автомобиля с рисунками для Менеджера по продажам</li>
    </ol>

    <h4>В каких условиях используют программу?</h4>
    <ol>
      <li> Менеджер по продажам, с телефоном в руке на улице</li>
      <li>Сall-center - работает в офисе</li>
      <li>Можно отдельные страницы выдать клиентам - чтобы смотреть на какой стадии продажа. Для просмотре в телефоне
      </li>
      <li>Используют iPhone или Android телефоны</li>
    </ol>


    <h4>Как собрать отзывы, критику и предложения по программе?</h4>
    <ol>
      <li> Посидеть с отдельными пользователями, которые хорошо знают программу</li>
      <li> Сделать опрос через электронну почту</li>
      <li> Попросить назвать 5 самых неудобных мест сайта, и свои предложения по улучшению этого </li>
      <li> МОжно сделать это ананимно, через гостевую книгу без регистрации, вдруг кто-то постесняется высказаться по почте</li>
    </ol>


  </div>
</template>
<script setup lang="ts">
</script>