<template>
  <h3> Что сделано </h3>
  <i>Некоторые особенности, которые задуманы улучшить программу</i>

  <ul>

    <li>
      В телефоне таблицы преобразовываны в колонки, В разделе оценки
    </li>
    <li>
      Меню в телефоне прячется с краю и вызывается кнопкой-гамбургером
    </li>
    <li>
      Теперь в меню можно делать вложенные разделы
    </li>
    <li>
      У меню есть три режима, обычный - маленький, развернутый и скрытый для мобильников.
    </li>
    <li>
      Если страница большая - появляется кнопка для прокрутки вверх
    </li>
    <li>
      Теперь статичные ответы сервера (типа модели автомобилей) кешируются, единыжды вызванные больше не запрашиваются.
    </li>
    <li> ---------------------</li>
    <li>
      Новая программа основана на самых передовых технологиях, которые ускоряют работу сайта, и удобны в поддержке:
      Vue3 CompositionApi, ElementPlus, сборщик Vite
    </li>

  </ul>
</template>
<script setup lang="ts">
</script>