<template>
  <h3> Что сделано </h3>
  <i>Некоторые особенности, которые задуманы улучшить программу</i>

  <ul>

    <li>
      В телефоне таблицы преобразовываны в колонки, В разделе оценки
    </li>
    <li>
      Меню в телефоне прячется с краю и вызывается кнопкой-гамбургером сверху слева
    </li>
    <li>
      Теперь в меню можно делать вложенные разделы
    </li>
    <li>
      Если страницы длинная появляется кнопка для прокрутки вверх
    </li>
    <li>
      Новая программа основана на самых передовых технологиях, которые ускоряют работу сайта, и удобны в поддержке:
      Vue3 CompositionApi, ElementPlus, сборщик Vite
    </li>

  </ul>
</template>
<script setup lang="ts">
</script>