<template>
  <h3> Что сделано </h3>
  <i>Некоторые особенности, которые задуманы улучшить программу</i>

  <ul>

    <li>
      В мобильной версии сайта таблицы преобразовываются в колонки.
    </li>
    <li>
      Меню в мобильной версии прячется с краю и вызывается кнопкой-гамбургером.
    </li>
    <li>
      Теперь в меню можно делать вложенные разделы.
    </li>
    <li>
      У меню есть три режима отображения, обычный - только иконки, развернутый с текстом и скрытый для мобильников.
    </li>
    <li>
      Если страница большая - появляется кнопка для прокрутки наверх
    </li>
    <li>
      Теперь статичные ответы сервера (типа модели автомобилей) кешируются, единыжды вызванные больше не запрашиваются.
    </li>
    <li>
      При использовании фильтра, запрос не уходит пока не нажмут кнопку "Искать и закрепить". Сама кнопка отображается
      если только имеется в ней нужда. Теги по фильтрам более информативные.
    </li>
    <li>
      Фильтры стандартизированы, параметризированы, выведены в отдельные модули. Это позволит легко добавлять и
      редактировать старые разделы.
    </li>
    <hr>
    <li>
      Новая версия программы основана на самых передовых технологиях на сегодняшний день, что ускоряет работу
      сайта, и удобнее в последующей поддержке: Vue3 CompositionApi, ElementPlus, сборщик Vite
    </li>

  </ul>
</template>
<script setup lang="ts">
</script>