<template>
  <div>
    <i style="float: right; text-align: right">Если критикуешь - предлагай !<br>Нефертити.</i><br>
    <h4>По моему нужно по крайней мере подумать:</h4>
    <ul>
      <li>
        Когда у комбобокса нет данных, комбобокс выглядит задизабленным. Наверно нужно чтобы показывал "Нет данных"
      </li>
      <li>
        Много элементов на сайте имеют только иконки. Неясно пока не нажмешь, что делает контрол. Наверно нужно добавить
        тултипы
      </li>
      <li>
        Разнообразные действия :(переход на другую страницу, открытие комбобокса, выполнение команды, раскрытие
        комбобокса)
        отображаются одинаковыми кнопками на одном уровне. Наверно нужно как-то группировать или кнопки делать с
        подсказками.
      </li>
      <li>
        Некоторые модальные окна наверно можно было бы сделать перемещаемыми. А некоторые с меняющимся размером
      </li>
      <li>
        Обязательные поля выглядят по разному. Где-то анимация. НАверно нужно унифицировать. Звездочка, если не набили
        красный текст под контролом, с перемоткой к первому
      </li>
      <li>
        Слева меню разросся - больше двадцати. Может группировать?, скрывать целым семейством под одну позицию?
      </li>
      <li>
        В телефонной версии меню наверх перемещается.. Лучше бы скрывать и показывать по кнопке-гамбургеру
      </li>

      <li>
        Не ясно как используются хлебные крошки. Наверно самое видное место на сайте нужно использовать для отображения
        самых важных вещей.

      </li>
      <li>
        Иногда страницы не имеют заголовка, не ясно где находшься.
      </li>
      <li>
        Думаю ошибкой, что нельзя узнать на какой стадии находится каждая сделка. И не отображается в заголовке
      </li>
      <li>
        Частенько есть переходы на другие страницы с возвращением. Наверно правильнее было бы использовать модалки для
        этого
      </li>
      <li>
        Практикуется открытие новой вкладки, чтобы легче было вернуться. Это нагрузка для компа - съедается опеативка.
        Проще было бы кешировать данные и возвращаться на ранее посещенные страницы мгновенно
      </li>
      <li>
        Мало что кешируется. Это тоже нагрузка на устройства и на сервер, не нужно каждый раз из сервера забирать данные
        если эти данные уже есть у пользователя. Те данные которые онлайн обновляются, наверно должны как-то сообщать,
        что данные изменились, и после этого только запросить обновление
      </li>
      <li>
        Не слишком ли много контролов на страницу. нельзя ли часть из них не показывать, если не используется
      </li>


    </ul>

  </div>
</template>
<script setup lang="ts">
</script>