<template>
  <h4>Идеал</h4>
  <i style="font-size: small">
    Назначение данного раздела - попытаться вглядеться в будущее и найти идеи, которые можно начинать реализовать сегодня.
    Поделитесь своими самыми сумасшедшими идеями и фантазиями</i>


  <div>
    <ol>
      <li>Используя данную программу, можно сфоткать VIN любой машины и посмотреть историю по продажам, по авариям, по
        ремонтам
      </li>
      <li>
        То же что и первый пункт, данные только не по VIN, а по характерным признакам, цвет, царапины, оригинальные
        особенности
      </li>
      <li>
        Сфоткав все повреждения, и отправивив на сервер, получить оценку и корридор цен для покупки и продажи
      </li>
      <li>
        Получить от клиента набор фоток, и сразу отправить предложение по покупке, для последующей перепродажи
      </li>
      <li>
        Call-center получает в онлайн режиме свежий набор предложений по продаже из всех агрегаторов типа авита и может
        сразу либо позвонить, либо отпарвить сообщение в телеграмме или в других популярных чатах
      </li>
      <li>
        Программа по телефону услышав имя фамилию за оператора начинает набивать формы.
      </li>
      <li>
        По скану какого-то документа, находит все остальные необходимые для сделки данные
      </li>
      <li>
        Хорошая фантазия: Мне кажется можно это уже сейчас делать. Звонит клиент, хочет продать свою машину, хочет
        узнать какие условия, какая цена..
        Робот задает нескколько типичных вопросов и отправляет клиенту ссылку на страницу сайта. Например по QR коду
        предоставляется страницвф сайта под этот телефон
        Там список: отправьте vin, марку и возвраст машины, 8 фото с разных ракурсов, царапины , историю поломок и т.п.
        Получив от клиента эти данные,
        делается быстрая аналитика, и в течении нескольких минут (все мнгновенно вычисляется по условиям анкеты) клиент
        получает предложение.
        Если хотите дорого продать, 900тр, но вероятность что продастся в течении 2 месяцев 40% ,а если хотите быстро,
        за 700тр в течении 2 недель..
        Клиент принимает решение, дальше работа с менеджерами..
        Получается, часть работ можно автоматизировать.
        <br><br>
        PS: Могут конечно все бесплатно воспользоваться этой услугой, чтобы узнать, какой у них есть ликвид.
        Для фирмы не будет больших трат - работают роботы. Но польза есть - будет накапливаться база, плюс - хорошая
        реклама фирмы.
        Люди будут предлагать друг другу эту бесплатную услугу, и это хорошо.
        Почти чат жипити...
      </li>
    </ol>
  </div>
</template>
<style>
li {
  line-height: 1.8;
}
</style>
<script setup lang="ts">
</script>