<template>
  <h4>Идеал</h4>
  <i style="font-size: small">Данный раздел абстрактный, чтобы представить, что мы хотим получить из фантастичного
    будущего для решения сегодняшних
    задач</i>

  <p>
    <ol>
      <li>Используя данную программу, можно сфоткать VIN любой машины и посмотреть историю по продажам, по авариям, по
        ремонтам
      </li>
      <li>
        То же что и первый пункт, данные только не по VIN, а по характерным признакам, цвет, царапины, оригинальные
        особенности
      </li>
      <li>
        Сфоткав все повреждения, и отправивив на сервер, получить оценку и корридор цен для покупки и продажи
      </li>
      <li>
        Получить от клиента набор фоток, и сразу отправить предложение по покупке, для последующей перепродажи
      </li>
      <li>
        Call-center получает в онлайн режиме свежий набор предложений по продаже из всех агрегаторов типа авита и может
        сразу либо позвонить, либо отпарвить сообщение в телеграмме или в других популярных чатах
      </li>
      <li>
        Программа по телефону услышав имя фамилию за оператора начинает набивать формы.
      </li>
      <li>
        По скану какого-то документа, находит все остальные необходимые для сделки данные
      </li>


    </ol>
  </p>
</template>
<script setup lang="ts">
</script>