<template>
  <div>
    <ol>
      <li> Если свести две рекомендации: <br>
        - Заголовок сайта сообщает что-то важное. <br>
        - Статус сделки должен быть виден всегда.<br>
        Можно в заголовке использоать контрол "Шаги", с возможностью навигации как в хлебных крошках:


        <el-steps :active="2" style="background: white; padding: 30px">
          <el-step title="Обращение"/>
          <el-step title="Набор данных" :icon="Edit"/>
          <el-step title="Аналитика: Оценка"/>
          <el-step title="Ремонт"/>
          <el-step title="Продажа"/>
        </el-steps>

        <br>
      </li>
      <li>Использовать темную тему, чтобы операторы могли переключить экран на щадящий режим работы монитора</li>

      <li>Часть страниц сделать сделать для использования на телефоне. А лучше все.</li>

      <li>
        Для этого нужно оставить на странице только необходимое - меньше контролов. Большие
        разделы разбивать на шаги. <br><i>Это облегчит перевод сайта на мобильную версию, а также упростит
        взаимодействие с
        программой</i>
      </li>
      <li>
        В информационный век, хорошо бы также делиться с информацией с клиентом.
        Это увеличит у клиента причастность к процессу, доверие и привязанность к организации.
        Можно давать доступ к некоторым страницам без регистрации так, чтобы эту страницу мог видеть только клиент.
        Для этого создается поддомен с использованием GUID. Выглядеть будет так
        http://live.autonet.pro/QWdq@we#q833k4we34$$. На этой странице будут данные только для этого клиента, никто не
        сможет попасть на эту страницу, кроме клиента и
        байера. Адрес по сети можно отправить в виде ссылки, а в печатном в виде QR-кода. Потом страница удаляется.
      </li>

    </ol>
  </div>
</template>

<script setup lang="ts">
import {Edit, Picture, Upload} from '@element-plus/icons-vue'
</script>