<template>
  <div>
    <h4>При тестировании смотрим на такие параметры как:</h4>

    1 Полнота<br>
    <i>Все ли требования выполняются к выбранному функционалу
      (пишем требования и сравниваем)</i><br><br>
    2 Однозначность<br>
    <i>Требования должны трактоваться всеми одинаково.
      ("должен быстро" плохо - "список за 3 сек" - хорошо)
      чтобы даже непосвященный в тему, понимал одинаково</i><br><br>
    3 Непротиворечивость<br>
    <i>Все пункты требований согласуется с другими</i><br><br>
    4 Необходимость<br>
    <i>Кратко но емко. Лишнее максимально убрать/скрыть</i><br><br>
    5 Осуществимость.<br>
    <i>Некоторые требования могут быть неосуществимы в принципе. Например выдать весь список пользователей, если их
      миллион, это и не надо, и приведет к лишим тратам</i><br><br>
    6 Тестируемость<br>
    <i>Если нельзя требование повторить сейчас</i>


    <h4>Доступность </h4>
    Восприятие - ясно пользователю<br>
    Управляемость - навигация по сайту доступна не только мышкой но и клавиатурой<br>
    Понятность - читаемое а не закодированное содержимое<br>
    Надежность - доступна с компа с телефона<br>


    <h4>Где что и как тестировать </h4>
    просмотр страниц сайта на нескольких мониторах с разным разрешением<br>
    просмотр сайта посредством наиболее популярных браузеров<br>
    проверка соответствия времени, которое затрачивается на загрузку страниц, норме (с учетом скорости Интернета)<br>
    проверка корректности гиперссылок<br>
    проверка корректности размещения графических материалов<br>
    проверка наличия и корректности альтернативных надписей изображений<br>
    проверка работы счетчиков, модуля обратной связи<br>
    проверка всех страниц на предмет наличия-отсутствия пунктуационных и орфографических ошибок.<br>

    <h4>Правила Юзабилити</h4>
    <ol>
    <li> Видимость статуса системы<br>
      (если  загружается - ромашка, если ошибка, сообщение, под кем зашел, какое время, где находимся)</li>
      <li>Схожесть системы с реальным миром<br>
        (заменить непонятные иконки,  навигация как по комнатам)</li>
      <li>Свобода действий.<br>
        ( возможность отмены!,   сделать другим путем)</li>
      <li>Стандарты.<br>
        (как в других сайтах уже привыкли)</li>
      <li>Предотвращение ошибок.<br>
        (кнопки недоступны, пока не выбран элемент)</li>
      <li> Узнаваемость<br>
        (Не изобретать иконки, выбрать привычное)</li>
      <li> Гибкость.<br>
        (Несколько способов делать это (похоже на 3)</li>
      <li>Простота.<br>
        (Минимализм)</li>
      <li>Понимание проблем и их решение.<br>
        (правильные подсказки ошибок)</li>
      <li>Справочные материалы и документация<br>
        (FAQ, Часто задаваемые вопросы, подсказки)</li>

    </ol>


    <h4>Требования к юзабилити — общие для всех сайтов</h4>
    <ol>
      <li> Страницы сайта загружаются не дольше, чем 5 секунд (как проверить и улучшить
    скорость загрузки страниц, рассказано в статье SEO-аудит: подробное
        руководство).</li>
        <li> Логотип хорошо заметен, размещен сверху, на него можно кликнуть и он является
          ссылкой на главную страницу.</li>
          <li> “Девиз” (“уникальное торговое предложение”, “точки дифференциации”,
    “предназначение”) сформулирован кратко, четко, понятно, убедительно и
            размещен в верхней части сайта.</li>
            <li> URL-адрес сайта — осмысленный, его легко запомнить (подробнее читайте
              оптимизация URL-адресов страниц сайта).</li>
      <li> Поиск — в верхней части сайта, его легко найти.</li>
                <li> Используется поиск по сайту от Google или Яндекс.
                </li>
      <li> Между фоном и текстом — хороший контраст. Все тексты написаны темным
    цветом на светлом фоне. Светлый текст на темном фоне — только для модных
    дизайнерских сайтов.
      </li>
      <li>Самая важная информация размещена на верхнем экране, ее можно прочитать без
    вертикальной прокрутки.
      </li>
      <li>Страница ошибки 404 — не стандартная, а доработанная. Она выполнена в дизайне
    сайта, содержит ссылки на самые важные страницы.
      </li>
      <li> Есть карта сайта в формате HTML, а для больших сайтов — и в XML.
      </li>
      <li> На сайте есть страница “О нас” или “О компании”, ссылка на нее легко заметна.
      </li>
      <li> При разрешении 1024*768 и больше — горизонтальная полоса прокрутки
    отсутствует. При меньших разрешениях — горизонтальная прокрутка допускается.
      </li>
      <li> В текстах междустрочный интервал 1,5 размера шрифта.
      </li>
      <li>. Расстояние между абзацами больше, чем междустрочный интервал
      </li>
      <li> В текстах все ссылки подчеркнуты, отображаются другим цветом. Стандарт —
    текст черный, а ссылки в нем синие.
      </li>
      <li> При наведении на ссылку курсор мышки принимает форму руки.
      </li>
      <li> У ссылок, которые пользователь уже посещал, меняется цвет. Стандарт — синий
    цвет меняется на фиолетовый.
      </li>
      <li> Страницы сайта выглядят более-менее одинаково в разных браузерах: Chrome,
    FireFox, новый Internet Explorer.
      </li>
      <li> Если целевая аудитория использует старые версии Internet Explorer, то реализована
    поддержка этого браузера.
      </li>
      <li> Страницы сайта нормально отображаются, если пользователь меняет в браузере
    размер шрифта, нажимая Ctrl+ или Ctrl-.
      </li>
      <li> В навигационном меню есть ссылки на все основные категории страниц сайта или
    даже на самые важные страницы.
      </li>
      <li> Названия разделов и страниц сайта — понятные и четко соответствуют их
        содержимому.</li>
    </ol>
  </div>
</template>
<script setup lang="ts">
</script>