<template>
  <main style="margin: 8px">

    <h3>Ver. 0.9.4</h3>
    <p>
      Модальное окно для редактирования обращений.<br><br>
      Можно добавить и отобразить События(todo), SMS, Историю и Комментарии<br><br>
      Можно скачать договор по получению SMS<br><br>
    </p>

    <h3>Ver. 0.9.3</h3>
    <p>
      Возможность работы с отключенным интернет. <br><br>
      Теперь можно отключив интернет сохранить несколько обращений,
      и когда появится хороший интернет, отправить их на сервер.
    </p>

    <h3>Ver. 0.9.2</h3>
    <p>
      Раздел Декстоп. Можно создавать обращения.<br><br>
      Работает парсинг для Авито ссылок, поиск Клиента по номеру телефона, и по VIN<br><br>
      Плюсом идет "Форматирование номера телефона", проверка почты и наличия обязательных полей.
    </p>


    <h3>Ver. 0.9.3</h3>
    <p>
      Списки и фильтры для разделов Обращения, Оценки, Склад, Реализация. <br><br>
      Фильтры параметризированы, разбиты на моудли для удобной поддержки.
    </p>

    <h3>Ver. 0.9.2</h3>
    <p>
      Левое меню. Адаптировано для работы с разными экранами.<br><br>
    </p>

    <h3>Ver. 0.9.1</h3>
    <p>
      Авторизация, настройка работы с API выбранных сайтов.<br><br>
    </p>

  </main>


</template>
<script setup>
import {useGlobalStore} from "@/stores/globalStore";

const globalStore = useGlobalStore()

globalStore.setTitle('Версия: ' + globalStore.version)
globalStore.steps = []
</script>