<template>
  <main style="margin: 8px">

    <h3>Ver. 0.9.8</h3>
    <p>
      Модалки тепреь можно по Esc закрывать.<br><br>
      В админке раздел клиенты появились<br><br>
      Можно добавить фотки для пользователей<br><br>
      Добавлена доска обьявлений с примером как работать с рисунками из буфере обмена <br><br>
    </p>

    <h3>Ver. 0.9.7</h3>
    <p>
      Редактирование обращений в модальном окне.<br><br>
      Новый интерфейс: элементы собраны в группы по функциональности<br><br>
      Работают События(todo для разных пользователей), SMS, Историю и Комментарии<br><br>

    </p>

    <h3>Ver. 0.9.6</h3>
    <p>
      Возможность работы с отключенным интернет. <br><br>
      Теперь можно отключив интернет сохранить несколько обращений,
      и когда появится хороший интернет, отправить их на сервер.
    </p>

    <h3>Ver. 0.9.5</h3>
    <p>
      Раздел Декстоп. Можно создавать обращения.<br><br>
      Работает парсинг для Авито ссылок, поиск Клиента по номеру телефона, и по VIN<br><br>
      Плюсом идет "Форматирование номера телефона", проверка почты и наличия обязательных полей.
    </p>

    <h3>Ver. 0.9.4</h3>
    <p>
      Раздел Управление (админка). Можно создавать обращения.<br><br>
      Новый подход визуализации, отображением списка последниз использованных разделов.<br><br>
      Готовы разделы, Пользователи, Оргструктура и еще несколько
    </p>


    <h3>Ver. 0.9.3</h3>
    <p>
      Отображением таблиц и фильтры для разделов Обращения, Оценки, Склад, Реализация. <br><br>
      Фильтры параметризированы, разбиты на модули для упрощения поддержки.
    </p>

    <h3>Ver. 0.9.2</h3>
    <p>
      Левое меню. Адаптирование работы сайта с разными экранами, мобильником. Ночной режим.<br><br>
    </p>

    <h3>Ver. 0.9.1</h3>
    <p>
      Авторизация, настройка работы с API с переключеннием сайтов.<br><br>
    </p>

  </main>


</template>
<script setup>
import {useGlobalStore} from "@/stores/globalStore";

const globalStore = useGlobalStore()

globalStore.setTitle('Версия: ' + globalStore.version)
globalStore.steps = []
</script>