<template>
  <main >
    <h4>Версия 0.10.0</h4>
    <p>
      В оценках заработал целиком лист осмотра.<br>
      Все разделы админки заработали.<br>
    </p>

    <h4>Версия 0.9.19</h4>
    <p>
      Настроены доступы к меню, некоторым разделам.<br>
      Для call-центра заработали отчеты <br>
    </p>

    <h4>Версия 0.9.18</h4>
    <p>
      Модалки тепреь можно по Esc закрывать.<br>
      В админке раздел клиенты появились<br>
      Можно добавить фотки для пользователей<br>
      Добавлена доска объявлений с примером как работать с рисунками из буфере обмена <br>
    </p>

    <h4>Версия 0.9.17</h4>
    <p>
      Редактирование обращений в модальном окне.<br>
      Новый интерфейс: элементы собраны в группы по функциональности<br>
      Работают События(todo для разных пользователей), SMS, Историю и Комментарии<br>

    </p>

    <h4>Версия 0.9.16</h4>
    <p>
      Возможность работы с отключенным интернет. <br>
      Теперь можно отключив интернет сохранить несколько обращений,
      и когда появится хороший интернет, отправить их на сервер.
    </p>

    <h4>Версия 0.9.15</h4>
    <p>
      Раздел Декстоп. Можно создавать обращения.<br>
      Работает парсинг для Авито ссылок, поиск Клиента по номеру телефона, и по VIN<br>
      Плюсом идет "Форматирование номера телефона", проверка почты и наличия обязательных полей.
    </p>

    <h4>Версия 0.9.14</h4>
    <p>
      Раздел Управление (админка). Можно создавать обращения.<br>
      Новый подход визуализации, отображением списка последниз использованных разделов.<br>
      Готовы разделы, Пользователи, Оргструктура и еще несколько
    </p>


    <h4>Версия 0.9.13</h4>
    <p>
      Отображением таблиц и фильтры для разделов Обращения, Оценки, Склад, Реализация. <br>
      Фильтры параметризированы, разбиты на модули для упрощения поддержки.
    </p>

    <h4>Версия 0.9.12</h4>
    <p>
      Левое меню. Адаптирование работы сайта с разными экранами, мобильником. Ночной режим.<br>
    </p>

    <h4>Версия 0.9.10</h4>
    <p>
      Авторизация, настройка работы с API с переключеннием сайтов.<br>
    </p>

    <h4>Версия 1.0.0</h4>
    <p>
      Через десктоп КЦ может добавить для юрлиц комиссионные. <br>Можно зачести клиента без телефона. <br>И требует
      телефон при наличии.<br>
    </p>

  </main>


</template>
<style scoped>
p {
  display: none;
}

h4 {
  cursor: pointer;
}

h4:hover + p {
  display: block;
}

</style>

<script setup>
import { useGlobalStore } from '@/stores/globalStore'

const globalStore = useGlobalStore()

globalStore.setTitle('Версия: ' + globalStore.version)
globalStore.steps = []
</script>