<template>
  <main>
    <div v-for="(entry, index) in versions" :key="index">
      <h5 @click="toggle(index)">{{ entry.title }}</h5>
      <p v-if="entry.open" v-html="entry.text"></p>
    </div>
  </main>
</template>

<script setup>
import { reactive } from 'vue'
import { useGlobalStore } from '@/stores/globalStore'

const globalStore = useGlobalStore()
globalStore.setTitle('Версия: ' + globalStore.version)
globalStore.steps = []

const versions = reactive([
  {
    title: 'Версия 1.0.0',
    text: `Через десктоп КЦ может добавить для юрлиц комиссионные. <br>Можно зачести клиента без телефона. <br>И требует
      телефон при наличии.<br>`,
    open: true,
  },
  {
    title: 'Версия 0.10.0',
    text: `В оценках заработал целиком лист осмотра.<br>Все разделы админки заработали.<br>`,
    open: false,
  },
  {
    title: 'Версия 0.9.19',
    text: `Настроены доступы к меню, некоторым разделам.<br>Для call-центра заработали отчеты <br>`,
    open: false,
  },
  {
    title: 'Версия 0.9.18',
    text: `Модалки тепреь можно по Esc закрывать.<br>В админке раздел клиенты появились<br>Можно добавить фотки для пользователей<br>Добавлена доска объявлений с примером как работать с рисунками из буфере обмена <br>`,
    open: false,
  },
  {
    title: 'Версия 0.9.17',
    text: `Редактирование обращений в модальном окне.<br>Новый интерфейс: элементы собраны в группы по функциональности<br>Работают События(todo для разных пользователей), SMS, Историю и Комментарии<br>`,
    open: false,
  },
  {
    title: 'Версия 0.9.16',
    text: `Возможность работы с отключенным интернет. <br>Теперь можно отключив интернет сохранить несколько обращений,
      и когда появится хороший интернет, отправить их на сервер.`,
    open: false,
  },
  {
    title: 'Версия 0.9.15',
    text: `Раздел Декстоп. Можно создавать обращения.<br>
      Работает парсинг для Авито ссылок, поиск Клиента по номеру телефона, и по VIN<br>
      Плюсом идет "Форматирование номера телефона", проверка почты и наличия обязательных полей.`,
    open: false,
  },
  {
    title: 'Версия 0.9.14',
    text: `Раздел Управление (админка). Можно создавать обращения.<br>
      Новый подход визуализации, отображением списка последниз использованных разделов.<br>
      Готовы разделы, Пользователи, Оргструктура и еще несколько`,
    open: false,
  },
  {
    title: 'Версия 0.9.13',
    text: `Отображением таблиц и фильтры для разделов Обращения, Оценки, Склад, Реализация. <br>
      Фильтры параметризированы, разбиты на модули для упрощения поддержки.`,
    open: false,
  },
  {
    title: 'Версия 0.9.12',
    text: `Левое меню. Адаптирование работы сайта с разными экранами, мобильником. Ночной режим.<br>`,
    open: false,
  },
  {
    title: 'Версия 0.9.10',
    text: `Авторизация, настройка работы с API с переключеннием сайтов.<br>`,
    open: false,
  },
])

function toggle(index) {
  versions[index].open = !versions[index].open
}
</script>

<style scoped>
h4 {
  cursor: pointer;
  user-select: none;
  margin-top: 1rem;
  margin-bottom: 0.5rem;
}

p {
  margin-left: 1rem;
}
</style>
